SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
		UTIL_TIMER_Create(&TxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
		UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
		UTIL_TIMER_Create(&JoinLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);
		UTIL_TIMER_SetPeriod(&TxLedTimer, 500);
		UTIL_TIMER_SetPeriod(&RxLedTimer, 500);
		UTIL_TIMER_SetPeriod(&JoinLedTimer, 1000);

		UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);
		UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
		UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_DisplayOnLCD), UTIL_SEQ_RFU, lcd_print_buf);

		LoraInfo_Init();

		/* Initialize all callbacks */
		LmHandlerInit(&LmHandlerCallbacks);

		/* Print LoRaWAN information : DevEUI & Devaddr when ABP - DevEUI & AppEUI-JoinEUI for OTAA */
		/* Print Session Keys for ABP - Print Root Key for OTAA :LmHandlerConfigure() > LoRaMacInitialization() > SecureElementInit() > PrintKey() */
		LmHandlerConfigure(&LmHandlerParams);

		/* Let all print out terminated. Otherwise logs are affected.*/
		HAL_Delay(500);

		/* Join Red LED starts blinking */
		UTIL_TIMER_Start(&JoinLedTimer);

		/* Join procedure for OTAA */
		/* First try to Join Network. Next time the Device tries to send data (LmHandlerSend), it will check the Join.
		 * If the first Join was NOT successful, it sends another Join.
		 */
		LmHandlerJoin(ActivationType);
	}
}


// Callback for byte reception
static void byteReception(uint8_t *PData, uint16_t Size, uint8_t Error){
	static uint32_t index = 0;

	USART2->TDR = *PData;

	if ( *PData == '\r' ){
		rxBuff[index] = '\0';

		if ( strcmp(rxBuff , "t") == 0){

			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tTransmition required by the user\r\n");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "Transmission required by user");
			UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
			if (SEND_BY_PUSH_BUTTON == false){
				UTIL_TIMER_Start(&TxTimer);
			}
		}
		else if ( strcmp(rxBuff , "r") == 0){
			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tThe Device is resetting...\r\n");
			NVIC_SystemReset();
		}
		else if ( strcmp(rxBuff , "help") == 0 || strcmp(rxBuff , "h") == 0){
			APP_LOG_COLOR(BLUE);
			APP_LOG(0, 1, "\t- t \t\t transmission of a new LoRaWAN packet\r\n");
			APP_LOG(0, 1, "\t- r \t\t Reset End-Device\r\n");
			APP_LOG(0, 1, "\t- h \t\t Help\r\n");
			APP_LOG(0, 1, "\t- lora \t\t Enter Raw LoRa Packet mode\r\n");

			lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "- t    Transmit new packet");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "- r    Reset");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "- h    Help");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "- lora Enter Raw LoRa mode");
		}

		else if ( strcmp(rxBuff , "lora") == 0 ){
			if( LoRaMode == 0 ){
				LoRaMode = 1;
				UTIL_TIMER_Stop(&TxTimer);
				BSP_PB_DeInit(BUTTON_SW1);
				APP_LOG_COLOR(RED);
				APP_LOG(0, 1, "\tLoRaWAN application stops\r\n");
				APP_LOG_COLOR(BLUE);
				APP_LOG(0, 1, "\r\n\r\nRaw LoRa Packet Application\r\n\r\n");
				APP_LOG_COLOR(WHITE);
				APP_LOG(0, 1, "\r\nType the following command to send a Raw LoRa Packet\r\n");
				APP_LOG(0, 1, "> Command format : LORA=Frequency:Power:SF:Payload\r\n");
				APP_LOG(0, 1, "> Example :        LORA=868100000:14:7:01020304 \r\n");

				lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
				lcd_printf(LCD_RED, "###############################");
				lcd_printf(LCD_RED, "LoRaWAN application stopped");
				lcd_printf(LCD_RED, "###############################");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "Raw LoRa Packet Application");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "Please refer to the console");
			}
			else{
				APP_LOG_COLOR(RED);
				APP_LOG(0, 1, "\r\n - You already entered the Raw LoRa Packet mode\r\n - To send a LoRa command please use this format: LORA=Frequency:Power:SF:Payload\r\n");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "Already in Raw LoRa mode");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "Please refer to the console");
			}
		}
		else if(isTriggered == 1)
		{
			PrepareLoRaFrame("ERROR");
			isTriggered = 0;
			index = 0;
		}
		else if (LoRaMode == 1){
			PrepareLoRaFrame(rxBuff);
		}

		else{
			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tUnknown command\r\n");
		}
		index = 0;
	}
	else{
		rxBuff[index++] = *PData;
		if ( index == RX_BUFF_SIZE ){
			isTriggered = 1;
			index = 0;
		}
	}
	APP_LOG_COLOR(RESET_COLOR);

	//lcd_printf(LCD_DEFAULT_FONT_COLOR, "Byte reception");
	lcd_print_buf();
}

void CENTER_Pressed_Button(void){
	//APP_LOG(0, 1, "Center button pressed!\r\n");
	APP_LOG(0, 1, "Forced transmission by user\r\n");
	lcd_printf(LCD_BLUE, "Forced transmission");
}

void DOWN_Pressed_Button(void){
	//APP_LOG(0, 1, "Down button pressed!\r\n");
	APP_LOG(0, 1, "Clear LCD screen\r\n");
	ST7789_Fill_Color(LCD_DEFAULT_BACKGROUND);
}

void LEFT_Pressed_Button(void){
	// Reset device
	APP_LOG(0, 1, "Reset Forced by user\r\n");
	NVIC_SystemReset();
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	switch (GPIO_Pin)
	{
	case  BUTTON_SW1_PIN:
		UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
		break;
	case GPIO_PIN_4:
		LEFT_Pressed_Button();
		break;
	//PROJECT BUTTON LCD
	case  GPIO_PIN_9:
		CENTER_Pressed_Button();
		UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
		break;
	//PROJECT BUTTON LCD END
	case  GPIO_PIN_8:
		DOWN_Pressed_Button();
	case  BUTTON_SW2_PIN:
		break;
	case  BUTTON_SW3_PIN:
		break;
	default:
		break;
	}
}

//PROJECT BUTTON LCD
void EXTI9_5_IRQHandler(void)
{
	if ((EXTI->PR1 & EXTI_PR1_PIF8) == EXTI_PR1_PIF8) {
		// Pin 8 is IT source
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_8);

	}
	else if ((EXTI->PR1 & EXTI_PR1_PIF9) == EXTI_PR1_PIF9) {
		// Pin 9 is IT source
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_9);
	}
	else __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_8 | GPIO_PIN_9);

	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_DisplayOnLCD), CFG_SEQ_Prio_LCD);
}
//PROJECT BUTTON LCD END

void EXTI4_IRQHandler(void)
{
	// st7789 left button pressed
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_4);
}

static void SendTxData(void)
{
	UTIL_TIMER_Time_t nextTxIn = 0;
	uint32_t i = 0;
	uint8_t channel = 0;

	EnvSensors_Read(&sensor_data);
	sensor_data.stm32wl_temperature = (SYS_GetTemperatureLevel() >> 8);
	sensor_data.temperature_simulated = simuTemperature();
	sensor_data.humidity_simulated = simuHumidity();
	sensor_data.atim_thaq = simuAtim();
	sensor_data.watteco_tempo = simuWatteco();
	sensor_data.tct_egreen = simuTct();

	if (WATTECO_TEMPO) AppData.Port = WATTECO_TEMPO_PORT;
	else AppData.Port = APP_PORT;

