SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
	if(PAYLOAD_1234){
		AppData.Buffer[i++] = 0x01;
		AppData.Buffer[i++] = 0x02;
		AppData.Buffer[i++] = 0x03;
		AppData.Buffer[i++] = 0x04;
//		AppData.Buffer[i++] = 'H';
//		AppData.Buffer[i++] = 'E';
//		AppData.Buffer[i++] = 'L';
//		AppData.Buffer[i++] = 'L';
//		AppData.Buffer[i++] = 'O';
		AppData.BufferSize = i;
	}
	else if(!CAYENNE_LPP){
		if(PAYLOAD_TEMPERATURE){
			if(SENSOR_ENABLED){
				AppData.Buffer[i++] = sensor_data.stts751_temperature_int8;
			}
			else{
				AppData.Buffer[i++] = sensor_data.temperature_simulated;
			}
		}
		if(PAYLOAD_HUMIDITY){
			if(SENSOR_ENABLED){
				AppData.Buffer[i++] = sensor_data.hts221_humidity_int8;
			}
			else{
				AppData.Buffer[i++] = sensor_data.humidity_simulated;
			}
		}
		if(USMB_VALVE){
			AppData.Buffer[i++] = sensor_data.setpoint;
			AppData.Buffer[i++] = sensor_data.temperature_simulated;
		}
		else if(ATIM_THAQ){
			/* Fill the buffer with each useful bytes */
			AppData.Buffer[i++] = sensor_data.atim_thaq.header1;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header2;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header3;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header4;
			AppData.Buffer[i++] = sensor_data.atim_thaq.sensor_status>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.sensor_status;
			AppData.Buffer[i++] = sensor_data.atim_thaq.temperature>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.temperature;
			AppData.Buffer[i++] = sensor_data.atim_thaq.humidity>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.humidity;
			AppData.Buffer[i++] = sensor_data.atim_thaq.air_quality>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.air_quality;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end1;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end2;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end3;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end4;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end5;
		}
		else if(WATTECO_TEMPO){
			/* Fill the buffer with each useful bytes */
			for (uint16_t w_index = 0/* Watteco index to build the frame */; w_index < 256; w_index += 8){
				AppData.Buffer[i++] = sensor_data.watteco_tempo.data[w_index/64]>>(56-(w_index%64));
			}
		} 
		else if(TCT_EGREEN){
			/* Fill the buffer with each useful bytes */
			AppData.Buffer[i++] = sensor_data.tct_egreen.type;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type1;
			AppData.Buffer[i++] = sensor_data.tct_egreen.temperature>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.temperature;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type2;
			AppData.Buffer[i++] = sensor_data.tct_egreen.courant>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.courant;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type3;
			AppData.Buffer[i++] = sensor_data.tct_egreen.voltage>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.voltage;
		}
		AppData.BufferSize = i;
	}
	else{	// CAYENNE
		CayenneLppReset();
		if(PAYLOAD_TEMPERATURE){
			if(SENSOR_ENABLED){
				CayenneLppAddTemperature(channel++, (int16_t)(sensor_data.hts221_temperature_float));
			}
			else{
				CayenneLppAddTemperature(channel++, sensor_data.temperature_simulated);
			}
		}

		if(PAYLOAD_HUMIDITY){
			if(SENSOR_ENABLED){
				CayenneLppAddRelativeHumidity(channel++, (int16_t)(sensor_data.hts221_humidity_float));
			}
			else{
				CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity_simulated));
			}
		}
		CayenneLppCopy(AppData.Buffer);
		AppData.BufferSize = CayenneLppGetSize();
	}

	LoRaMacTxInfo_t txInfo;

	if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
	{
		/* This is written with TimeStamp ON > See function timeStampNow in sys_app.c */
		//APP_LOG(TS_ON, VLEVEL_L, " Packet transmitted\r\n");
	}
	else if (nextTxIn > 0)
	{
		APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
	}
}

uint8_t simuTemperature(void){
	static uint8_t temp=20, countUP = 0;
	static int8_t temp_valve = 40; // temp in Q7.1, so 40 = 20°C
	float error = 0;

	if(USMB_VALVE){
		/* Case thermostatic valve simulated.
		 * Temperature should reach the setpoint given by the user by adding at each function call
		 * half of the difference between the actual temperature and the setpoint.
		 * Variables are in Q7.1, so 41 = 20.5°C, from -128 to 127 => -64°C to 63.5°C*/
		error = ((float) (sensor_data.setpoint - temp_valve))/2;

		if (abs(error)<1.0 && error != 0){					// Correct the error rounding
			if (sensor_data.setpoint > temp_valve) error = 1.0;
			else error = -1.0;
		}

		temp_valve += error;
		return temp_valve;
	}
	else{
		if ( (temp == 20) || (temp == 25)){
			countUP = (countUP + 1)%2;
		}

		temp = (countUP == 1)? temp + 1 : temp - 1;
		return temp;
	}
}

uint8_t simuHumidity(void){
	static uint8_t humid = 50, countUP = 0;

	if ( (humid == 50) || (humid == 60)){
		countUP = (countUP + 1)%2;
	}

	humid = (countUP == 1)? humid + 1 : humid - 1;
	return humid;
}

/**
 * ATIM TAHQ simulated function payload 
 * @return atim payload with changing temperature
 */
atim_payload_t simuAtim(void){
	static atim_payload_t payload = {0xE0, 0x67, 0xB8, 0x3C, 0x0D08, 0x07C7, 0x0912, 0xC20C, 0x00, 0x84, 0x0D, 0x05, 0x18}; /* Random real atim_thaq payload */
	static uint8_t countUP = 0;

	payload.temperature = (countUP==0)? 0x07C7: 0x07FA; /* Temperature in centi-degree cC */
	countUP = (countUP + 1) % 2;

	return payload;
}

/**
 * TCT EGREEN simulated function payload 
 * @return tct payload with changing currant and voltage
 */
tct_payload_t simuTct(void){
	static tct_payload_t payload = {0xa0, 0x08, 0x088f, 0x0b, 0x0071, 0x0a, 0x11bf};
	static uint8_t countUP = 0;

	// Let's have a constant power P = UI
	payload.courant = (countUP==0)? 0x0071: 0x006b; /* Currant in centi-ampere cA */
	payload.voltage = (countUP==0)? 0x11bf: 0x12be; /* Voltage in mV */
	countUP = (countUP + 1) % 2;

	return payload;
}

/**
 * Watteco temp'o simulated function payload 
 * @return fixed payload
 */
watteco_payload_t simuWatteco(void){
	return (watteco_payload_t) {0x2205805533c90160, 0xb49f200903084056, 0x00b202901580ac00, 0x6491aa4e954aa512};
}

static void OnTxData(LmHandlerTxParams_t *params)
{
	if ((params != NULL))
	{
		/* Process Tx event only if it is a mcps response to prevent some internal events (mlme) */
		if (params->IsMcpsConfirm != 0)
		{
			if(params->AppData.Port != 0){
				BSP_LED_On(LED_GREEN) ;
				UTIL_TIMER_Start(&TxLedTimer);

				// Print Timestamp
				char timestamp[20];
				uint16_t * size;
				TimestampNow((uint8_t *) timestamp, size);
				char stimestamp[32];
				strcpy(stimestamp, "_");
				strcat(stimestamp, timestamp+2);
				strcat(stimestamp, "_____________________");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
				lcd_printf(LCD_RED, stimestamp);
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "Payload");

				APP_LOG(0, 1, "- Payload     ");


