SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
				if(AppData.BufferSize>0)
				{
					if(USMB_VALVE){
						APP_LOG(0, 1, "Setpoint: %.1f °C | Temperature: %.1f °C", ((float) txBUFFER[0])/2, ((float) txBUFFER[1])/2);
						lcd_printf(LCD_DEFAULT_FONT_COLOR, "SetP: %.1f \x01""C | Temp: %.1f \x01""C", ((float) txBUFFER[0])/2, ((float) txBUFFER[1])/2);
					}
					else if(ATIM_THAQ){
						APP_LOG(0, 1, "Temperature: %.2f °C", ((float) (txBUFFER[6]<<8) + (float) txBUFFER[7])/100.0);
						lcd_printf(LCD_DEFAULT_FONT_COLOR, "Temperature: %.2f \x01""C", ((float) (txBUFFER[6]<<8) + (float) txBUFFER[7])/100.0);
					}
					else if(WATTECO_TEMPO){ // Simply print the buffer
						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%02X ", txBUFFER[i]);
						}
						lcd_printf(LCD_DEFAULT_FONT_COLOR, "WATTECO Temp'O buffer");
					}
					else if(TCT_EGREEN){
						APP_LOG(0, 1, "Currant: %.2f A | Voltage: %03u mV", ((float) (txBUFFER[5]<<8) + (float) txBUFFER[6])/100.0,
																			(txBUFFER[8]<<8) + txBUFFER[9]);
						lcd_printf(LCD_DEFAULT_FONT_COLOR, "Cur: %.2f A | Volt: %03u mV", ((float) (txBUFFER[5]<<8) + (float) txBUFFER[6])/100.0,
								(txBUFFER[8]<<8) + txBUFFER[9]);
					}
					else{
						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%02X ", txBUFFER[i]);
						}
						APP_LOG(0, 1, "(hex)  |  ");

						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%03u ", txBUFFER[i]);
						}
						APP_LOG(0, 1, "(dec)");
						lcd_printf(LCD_DEFAULT_FONT_COLOR, "  01 02 03 04 (dec)");
					}
				}

				APP_LOG(TS_OFF, VLEVEL_L, "\r\n");
				APP_LOG(TS_OFF, VLEVEL_L, "- Port        %d \r\n",params->AppData.Port);
				APP_LOG(TS_OFF, VLEVEL_L, "- Fcnt        %d \r\n",params->UplinkCounter);
				APP_LOG(TS_OFF, VLEVEL_L, "- Data Rate   %d",params->Datarate);
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "- Port        %d",params->AppData.Port);
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "- Fcnt        %d",params->UplinkCounter);
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "- Data Rate   %d", params->Datarate);

				switch(params->Datarate)
				{
					case 5 : APP_LOG(TS_OFF, VLEVEL_L, " (SF7)\r\n");break;
					case 4 : APP_LOG(TS_OFF, VLEVEL_L, " (SF8)\r\n");break;
					case 3 : APP_LOG(TS_OFF, VLEVEL_L, " (SF9)\r\n");break;
					case 2 : APP_LOG(TS_OFF, VLEVEL_L, " (SF10)\r\n");break;
					case 1 : APP_LOG(TS_OFF, VLEVEL_L, " (SF11)\r\n");break;
					case 0 : APP_LOG(TS_OFF, VLEVEL_L, " (SF12)\r\n");break;
				}

			}
			else{
				APP_LOG(TS_OFF, VLEVEL_L, "- Fcnt        %d \r\n",params->UplinkCounter);
			}
			// Print on LCD screen
			//lcd_printf(LCD_DEFAULT_FONT_COLOR, "OnTxDATA");
			lcd_print_buf();
		}
	}
}


static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
	static const char *slotStrings[] = { "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot" };
	char is_join = 1;

	if ((appData != NULL) || (params != NULL))
	{
		if( appData->Port == 0){
			// if port==0, it is join accept or MAC command
			//APP_LOG(TS_OFF, VLEVEL_L, "MAC Command RECEIVED\r\n");
			is_join = 0;
		}
		else{
			BSP_LED_On(LED_BLUE) ;
			UTIL_TIMER_Start(&RxLedTimer);
			APP_LOG_COLOR(BOLDBLUE);
			lcd_printf(LCD_BLUE, "________________________________");
			if (isRxConfirmed == 1){
				APP_LOG(TS_ON, VLEVEL_L, " Receiving Confirmed Data Down.\r\n");
				lcd_printf(LCD_BLUE, "Receiving Confirmed Data Down.");
			}
			else{
				APP_LOG(TS_ON, VLEVEL_L, " Receiving Unconfirmed Data Down.\r\n");
				lcd_printf(LCD_BLUE, "Receiving Unconf Data Down");
			}

			APP_LOG_COLOR(BLUE);
			APP_LOG(TS_OFF, VLEVEL_L, "- Payload     ");

			if(appData->BufferSize>0)
			{
				char * payload = "- Payload   ";
				for(int i=0 ; i<appData->BufferSize ; i++){
					APP_LOG(0, 1, "%02X ", appData->Buffer[i]);
					char val[16];
					itoa(appData->Buffer[i], val, 16);
					strcat(payload, val);
					strcat(payload, " ");
				}
				APP_LOG(0, 1, "(hex) ");
				strcat(payload, "(hex)");
				lcd_printf(LCD_BLUE, payload);
			}

			APP_LOG(TS_OFF, VLEVEL_L, "\r\n");
			APP_LOG(TS_OFF, VLEVEL_L, "- Port        %d \r\n",appData->Port);
			APP_LOG(TS_OFF, VLEVEL_L, "- Slot        RX%s \r\n",slotStrings[params->RxSlot]);
			APP_LOG(TS_OFF, VLEVEL_L, "- Data Rate   %d \r\n",params->Datarate);
			APP_LOG(TS_OFF, VLEVEL_L, "- RSSI        %d dBm\r\n",params->Rssi);
			APP_LOG(TS_OFF, VLEVEL_L, "- SNR         %d dB\r\n",params->Snr);
			APP_LOG_COLOR(RESET_COLOR);

			lcd_printf(LCD_BLUE, "- Port      %d",appData->Port);
			lcd_printf(LCD_BLUE, "- Slot      RX%s",slotStrings[params->RxSlot]);
			lcd_printf(LCD_BLUE, "- Data Rate %d",params->Datarate);
			lcd_printf(LCD_BLUE, "- RSSI      %d dBm",params->Rssi);
			lcd_printf(LCD_BLUE, "- SNR       %d dB",params->Snr);
		}

		switch (appData->Port)
		{
			case LORAWAN_SWITCH_CLASS_PORT:
				if (appData->BufferSize == 1)
				{
					APP_LOG_COLOR(GREEN);
					switch (appData->Buffer[0])
					{
						case 0: LmHandlerRequestClass(CLASS_A); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class A\r\n"); lcd_printf(LCD_DGREEN, "Switch to class A"); break;
						case 1: LmHandlerRequestClass(CLASS_B); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class B\r\n"); lcd_printf(LCD_DGREEN, "Switch to class B");break;
						case 2: LmHandlerRequestClass(CLASS_C); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class C\r\n"); lcd_printf(LCD_DGREEN, "Switch to class C");break;
						default: 								break;
					}
					APP_LOG_COLOR(RESET_COLOR);
				}
				break;

			case LORAWAN_USER_APP_PORT:
				if (appData->BufferSize == 1)
				{
					APP_LOG_COLOR(GREEN);
					AppLedStateOn = appData->Buffer[0] & 0x01;
					if (AppLedStateOn == RESET)
					{
						APP_LOG(TS_OFF, VLEVEL_L, "LED 3 (RED) goes OFF\r\n");
						lcd_printf(LCD_DGREEN, "LED 3 (RED) goes OFF");
						BSP_LED_Off(LED_RED) ;
					}
					else
					{
						APP_LOG(TS_OFF, VLEVEL_L, "LED 3 (RED) goes ON\r\n");
						lcd_printf(LCD_DGREEN, "LED 3 (RED) goes ON");
						BSP_LED_On(LED_RED) ;
					}
					APP_LOG_COLOR(RESET_COLOR);
				}
				break;

			case VALVE_APP_PORT:
				if (appData->BufferSize == 1)
				{
					APP_LOG_COLOR(GREEN);
					sensor_data.setpoint = appData->Buffer[0];
					APP_LOG(TS_OFF, VLEVEL_L, "New setpoint is set to %.1f °C\r\n", (float) sensor_data.setpoint/2);
					APP_LOG_COLOR(RESET_COLOR);
					lcd_printf(LCD_DGREEN, "New setpoint set to %.1f °C", (float) sensor_data.setpoint/2);
				}
				break;

			default:  break;
		}

		if (is_join != 0) {
			// Display logs on screen
			//lcd_printf(LCD_DEFAULT_FONT_COLOR, "OnRxDATA");
			lcd_print_buf();
		}
	}
}
static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
	if (joinParams != NULL)
	{
		if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
		{
			UTIL_TIMER_Stop(&JoinLedTimer);
			BSP_LED_Off(LED_RED) ;

			APP_LOG_COLOR(GREEN);
			if (joinParams->Mode == ACTIVATION_TYPE_ABP)
			{
				APP_LOG(TS_OFF, VLEVEL_L, "\r\n> ABP Activation mode\r\n");
				lcd_printf(LCD_DGREEN, "ABP Activation Mode");
				lcd_printf(LCD_DEFAULT_FONT_COLOR, "");
			}
			else
			{
				APP_LOG(TS_OFF, VLEVEL_L, "\r\n> JOINED = OTAA!\r\n");
				lcd_printf(LCD_DGREEN, "> JOINED = OTAA");
			}


			if(SEND_BY_PUSH_BUTTON == true){
				APP_LOG(0, 1, "> Packets will be sent on a Push Button event (B1) \r\n");
				lcd_printf(LCD_DGREEN, "> Packets send on PB");
			}
			else{
				APP_LOG(0, 1, "> Packets will be sent every %d ms OR on a Push Button event (B1) \r\n", ADMIN_TxDutyCycleTime);
				lcd_printf(LCD_DGREEN, "> Packets every %ds or PB", ADMIN_TxDutyCycleTime/1000);
			}

			APP_LOG_COLOR(RESET_COLOR);
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "");

			/* Create TIMER for sending next Tx Frame  */
			// if (EventType == TX_ON_TIMER)
			/*  if (SEND_BY_PUSH_BUTTON == true)
       {
    	 BSP_PB_Init(BUTTON_SW1, BUTTON_MODE_EXTI);		// BUTTON_SW1 = PA0, IRQ number = EXTI0_IRQn

