SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
       }*/
			/* Send every time button is pushed */
			if (SEND_BY_PUSH_BUTTON == false)
			{
				UTIL_TIMER_Create(&TxTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
				UTIL_TIMER_SetPeriod(&TxTimer,  APP_TX_DUTYCYCLE);
				UTIL_TIMER_Start(&TxTimer);
			}

			// Display logs on screen
			//lcd_printf(LCD_DEFAULT_FONT_COLOR, "OnJoinRequest, Success");
			lcd_print_buf();

			// Send a first frame just after the Join (When using timer event to send packets)
			if(SEND_BY_PUSH_BUTTON == false){
				SendTxData();
			}
		}
		else
		{
			APP_LOG_COLOR(RED);
			APP_LOG(TS_OFF, VLEVEL_L, "\r\n> JOIN FAILED...\r\n");

			lcd_printf(LCD_RED, "> JOIN FAILED...");
			lcd_printf(LCD_DEFAULT_FONT_COLOR, "");

			// Display logs on screen
			//lcd_printf(LCD_DEFAULT_FONT_COLOR, "OnJoinRequest, failed");
			lcd_print_buf();

			LmHandlerJoin(ActivationType);
			APP_LOG_COLOR(RESET_COLOR);
			APP_LOG(0, 1, " \r\n");
		}
	}
}

static void OnMacProcessNotify(void)
{

	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);

}


static void OnTxTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&TxTimer);
}

static void OnTxTimerLedEvent(void *context)
{
	BSP_LED_Off(LED_GREEN) ;
}

static void OnRxTimerLedEvent(void *context)
{
	BSP_LED_Off(LED_BLUE) ;
}

static void OnJoinTimerLedEvent(void *context)
{
	BSP_LED_Toggle(LED_RED) ;
}

/**
  * @brief Interruption button Initialization Function
  * @param None
  * @retval None
  */
static void MX_BP_IT_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();

	 /*Configure GPIO pin: PA9, Center button */
	 GPIO_InitStruct.Pin = GPIO_PIN_9;
	 GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	 GPIO_InitStruct.Pull = GPIO_NOPULL;
	 HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	 /*Configure GPIO pin: PA4, Left button */
	 GPIO_InitStruct.Pin = GPIO_PIN_4;
	 GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	 GPIO_InitStruct.Pull = GPIO_NOPULL;
	 HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	 /*Configure GPIO pin: PA8, Down button */
	 GPIO_InitStruct.Pin = GPIO_PIN_8;
	 GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	 GPIO_InitStruct.Pull = GPIO_NOPULL;
	 HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	 /* EXTI interrupt init*/
	 HAL_NVIC_SetPriority(EXTI9_5_IRQn, 1, 1);
	 HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

	 HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
	 HAL_NVIC_EnableIRQ(EXTI4_IRQn);
}
